# # 集合间的赋值
# l = [1,2,3]
# ll = [4,5,6]
#
# print(l)
#
# l = ll
# print(l.clear())
# l.append(1)
# print(l)

# # 拼接
# lll = ['2017-03-26:10', '05,17,22', '11']
# #
# # print(','.join(lll))
#
# content = ','.join(lll)
#
# print(content)
#
# print(list(content))
#
#
# a = []
# a.append(content)
# print(a)

type1List = ['显性故障', '干扰', '容量']

# content = (','.join((map(lambda x: repr(x), ['显性故障', '干扰', '容量']))))
# print(content)

#
# def getListInfo(bbb):
#     d = locals()
#     pname = list(d.keys())[0]
#
#     print(pname)
#     print('%s =  %s' % (pname, bbb))
#     print('the length of %s  = %s' % (pname, len(bbb)))
#
# locals()
# getListInfo(type1List)

# reasonSuggestMatch = [('2016-02-01', '19,20,21,22,23', 20, 'AA', '外部干扰', 1),
#                       ('2016-02-02', '11,12', 84, 'BB', 'X2接口故障告警', 1),
#                       ('2016-02-02', '11,12', 84, 'BB', 'X2接口故障告警', 1),
#                       ('2016-02-02', 'AllDay', 108, 'CC', 'X2接口故障告警', 1),
#                       ('2016-02-02', '00,01', 20, 'AA', '外部干扰', 1),
#                       ('2016-02-02', '02,03', 20, 'AA', '外部干扰', 1),
#                       ('2016-02-02', '04,05,06', 20, 'AA', '外部干扰', 1),
#                       ('2016-02-02', 'AllDay', 116, 'BB', 'X2接口故障告警', 1)]
#
# s = sorted(list(set(reasonSuggestMatch)), key=lambda x: x[2])[0:4]
#
# print(s)

s = [('2016-02-01', '19,20,21,22,23', 20, 'AA', '外部干扰', 1), ('2016-02-02', '00,01', 20, 'AA', '外部干扰', 1),
     ('2016-02-02', '02,03', 20, 'AA', '外部干扰', 1), ('2016-02-02', '04,05,06', 20, 'AA', '外部干扰', 1),
     ('2016-02-02', 'AllDay', 84, 'BB', 'X2接口故障告警', 1), ('2016-02-03', '11,12', 84, 'BB', 'X2接口故障告警', 1),
     ('2016-02-02', 'AllDay', 108, 'CC', 'X2接口故障告警', 1), ('2016-02-02', 'AllDay', 116, 'BB', 'X2接口故障告警', 1)]

ss = {('2016-02-02', 'AllDay', 116, 'BB', 'X2接口故障告警', 1), ('2016-02-02', 'AllDay', 108, 'CC', 'X2接口故障告警', 1),
      ('2016-02-02', '04,05,06', 20, 'AA', '外部干扰', 1), ('2016-02-02', '00,01', 20, 'AA', '外部干扰', 1),
      ('2016-02-02', '02,03', 20, 'AA', '外部干扰', 1), ('2016-02-03', '11,12', 84, 'BB', 'X2接口故障告警', 1),
      ('2016-02-02', 'AllDay', 84, 'BB', 'X2接口故障告警', 1), ('2016-02-01', '19,20,21,22,23', 20, 'AA', '外部干扰', 1)}

sss = [('2016-02-02', '00,01', 20, 'AA', '外部干扰', 1), ('2016-02-02', '04,05,06', 20, 'AA', '外部干扰', 1),
       ('2016-02-01', '19,20,21,22,23', 20, 'AA', '外部干扰', 1), ('2016-02-02', '02,03', 20, 'AA', '外部干扰', 1),
       ('2016-02-03', '11,12', 84, 'BB', 'X2接口故障告警', 1), ('2016-02-02', 'AllDay', 84, 'BB', 'X2接口故障告警', 1),
       ('2016-02-02', 'AllDay', 108, 'CC', 'X2接口故障告警', 1), ('2016-02-02', 'AllDay', 116, 'BB', 'X2接口故障告警', 1)]

ssss = [('2016-02-01', '19,20,21,22,23', 20, 'AA', '外部干扰', 1), ('2016-02-02', '04,05,06', 20, 'AA', '外部干扰', 1),
        ('2016-02-02', '00,01', 20, 'AA', '外部干扰', 1), ('2016-02-02', '02,03', 20, 'AA', '外部干扰', 1)]

sssss = [('2016-02-02', '00,01', 20, 'AA', '外部干扰', 1), ('2016-02-01', '19,20,21,22,23', 20, 'AA', '外部干扰', 1),
         ('2016-02-02', '04,05,06', 20, 'AA', '外部干扰', 1), ('2016-02-02', '02,03', 20, 'AA', '外部干扰', 1)]

import operator

# rsDict = {}
# for x in reasonSuggestMatch:
#     dhList = []
#     reason = x[4]
#     suggest = x[3]
#     date = x[0]
#     hour = x[1]
#     rs = (reason, suggest)
#
#     if rs not in rsDict:
#         dhList.append(date + ':' + hour)
#         rsDict[rs] = dhList
#     else:
#         print('rsDict[rs] = ', rsDict[rs])
#         if date in rsDict[rs][0]:
#             if 'AllDay' not in rsDict[rs][0]:
#                 rsDict[rs][0] = rsDict[rs][0] + (',' + hour)
#         else:
#             rsDict[rs][0] = rsDict[rs][0] + (';' + date + ':' + hour)
# print('rsDict = ', rsDict)


# t1 = ['a', 'b']
# t2 = ['c', 'd', 'e']
#
# print(t1)
# t1 = t2
# print(t1)



tt =['a','a','b']
ttt =[['a'],['a'],['b']]

print(len(set(tt)))
print(len(set(ttt))) # error
